import streamlit as st

# إعداد الصفحة
st.set_page_config(page_title="🚗 الرياض.. قلب سوق السيارات المستعملة في المملكة!", layout="wide")

# تطبيق CSS لجعل الاتجاه من اليمين إلى اليسار
st.markdown(
    """
    <style>
    body, .css-1d391kg {direction: rtl; text-align: right;}
    .css-18e3th9 {text-align: right;}
    </style>
    """,
    unsafe_allow_html=True
)

# العنوان الرئيسي
st.write("### 🚗 الرياض.. قلب سوق السيارات المستعملة في المملكة!")
st.image("eee.png", caption="سوق السيارات المستعملة", width=800)

# وصف السوق
st.markdown(
    """
    في قلب المملكة، حيث الشوارع الواسعة والتطور المستمر، تحتل الرياض مكانتها كأكبر سوق للسيارات المستعملة! لكن ليه تحديدًا؟ 🤔
    
    الرياض تشهد تطورًا كبيرًا مع خطط طموحة لرفع عدد سكانها إلى ١٥ مليون نسمة، مما يجعلها مدينة ذات اقتصاد مستقل وحركة تجارية قوية. مع تركز الشركات الكبرى فيها، ازداد عدد السكان، ما خلق سوقًا نشطًا للسيارات المستعملة، حيث يختلف الطلب من السيارات الاقتصادية إلى السيارات العائلية وسيارات النقل والتوصيل.
    
    الاقتصاد القوي يساهم في تنشيط حركة البيع والشراء، خاصة خلال المواسم مثل بداية السنة الدراسية أو فترة العيد، حين يزداد الطلب بشكل ملحوظ. هذا التنوع في المشترين يعزز وجود مختلف أنواع السيارات المستعملة في السوق، مما يجعل الرياض مركزًا رئيسيًا لهذا القطاع.
    """
)

# العوامل المؤثرة على سعر السيارة المستعملة
st.write("### 📉 العوامل التي تؤثر على سعر السيارة المستعملة")
st.image("output.png", caption="العوامل التي تؤثر على سعر السيارة المستعملة", width=800)

st.markdown(
    """
    🚗 **عدد الكيلومترات** – كلما زادت المسافة التي قطعتها السيارة، كلما انخفض سعرها بسبب زيادة الاستهلاك.\n
    📅 **سنة الصنع** – السيارات الأحدث تكون أغلى، نظرًا للتكنولوجيا الجديدة التي تحتويها.\n
    🎛️ **فئة السيارة** – السيارات المزودة بمزايا إضافية مثل الشاشات والسقف البانورامي تكون أعلى سعرًا.\n
    🌍 **بلد الاستيراد** – يفضل السعوديون السيارات ذات المنشأ المحلي لضمان الجودة وتوفر الصيانة والضمان الرسمي.\n
    """
)


# ليه تويوتا متصدرة سوق السيارات المستعملة؟
st.write("### 🚗 لماذا تتصدر تويوتا سوق السيارات المستعملة؟")
st.image("www.png", caption="الشركات المتصدرة في السعودية", width=800)

st.markdown(
    """
    تعتبر تويوتا الأكثر مبيعًا في سوق السيارات المستعملة بالرياض، والسبب يعود إلى:\n
    🔹 **المتانة والموثوقية** – سيارات تويوتا تعيش عمرًا طويلًا وتتمتع بجودة عالية.\n
    🔹 **الحفاظ على القيمة** – تنخفض أسعارها أقل مقارنةً بالسيارات الأخرى، مما يجعلها خيارًا استثماريًا جيدًا.\n
    🔹 **توفر القطع والصيانة** – من السهل العثور على قطع الغيار وبأسعار معقولة، كما أن مراكز الصيانة منتشرة في جميع أنحاء المملكة.\n
    🔹 **ثقة المستهلكين** – تويوتا لها سمعة قوية وسوق مستعمل نشط.\n
    🔹 **انتشارها الواسع** – من المدن إلى القرى والصحراء، تويوتا هي السيارة الأكثر استخدامًا بسبب متانتها وموثوقيتها.\n
    
    بفضل هذه العوامل، تظل تويوتا الخيار الأول لكثير من السعوديين في سوق السيارات المستعملة! 🚘🔥
    """
)

